package com.javarush.task.jdk13.task01.task0139;

/**
 * Поцелуй мой блестящий металлический зад
 * Первая программа "человеческих" студентов выводит на экран фразу "Hello World!".
 * А знаешь ли ты, что пишут брутальные робопрограммисты?
 * Только никому не рассказывай: "Поцелуй мой блестящий металлический зад!"
 * В этой задаче почувствуй себя настоящим робокодером и напиши программу, которая выведет на экран эту фразу.
 *
 *
 * Требования:
 * 1. Программа должна выводить текст.
 * 2. Текст должен начинаться с "Поцелуй".
 * 3. Текст должен заканчиваться знаком восклицания.
 * 4. Текст должен состоять из 40 символов, включая пробелы и знак восклицания.
 * 5. Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Поцелуй мой блестящий металлический зад!");
    }
}