package com.javarush.task.jdk13.task01.task0109;

/**
 * Объявление двух переменных
 * Объяви переменные a, b типа int.
 * Сразу же в строке объявления присвой им разные значения.
 * Значениями могут быть любые целые числа.
 *
 *
 * Требования:
 * 1. Объяви две переменные типа int.
 * 2. Имена переменных должны быть a и b.
 * 3. Переменным сразу должны быть присвоены значения.
 * 4. Переменные a и b должны иметь разные значения.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int a = 0;
        int b = 1;
    }
}
