package com.javarush.task.jdk13.task01.task0101;

/**
 * Я думаю, быть программистом - это круто
 * Напиши программу, которая выводит на экран надпись:
 * Я думаю, быть программистом - это круто
 *
 *
 * Требования:
 * 1. Программа должна выводить текст.
 * 2. Текст должен начинаться с "Я думаю".
 * 3. Текст должен заканчиваться на "это круто".
 * 4. Текст должен состоять из 39 символов, включая пробелы и знаки препинания.
 * 5. Текст должен состоять из одной строки.
 * 6. Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Я думаю, быть программистом - это круто");
    }
}
