package com.javarush.task.pro.task06.task0602;

/**
 * Упорядоченная информация
 * Перед тобой — плохой пример использования методов:
 *
 * Методы разделили двустишие;
 * Одну строку кода не стоит оборачивать в отдельный метод.
 * Перепиши код так, чтобы весь текст выводился в методе main, а остальные методы удали.
 * Вывод программы не должен измениться.
 *
 * Требования:
 * 1. Метод main() должен быть единственным методом в классе Solution.
 * 2. Вывод в консоли должен соответствовать условию задачи.
*/

public class Solution {
    public static void main(String[] args) {
        System.out.println("Я — поэт, зовусь я Цветик.");
        System.out.println("От меня вам всем приветик.");
    }
}
