package com.javarush.task.jdk13.task01.task0118;

/**
 * Закомментируйте лишнее
 * Закомментируй часть кода, чтобы на экран вывелось сообщение "sum = 12".
 *
 *
 * Требования:
 * 1. Программа должна выводить на экран текст.
 * 2. Нужно закомментировать необходимые строки и не менять остальные.
 * 3. В программу нельзя добавлять новые строки или удалять имеющиеся.
 * 4. Выведенный текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        int a = 3;
//        int a = 10;
        int b = 6;
//        int b = 12;
//        int sum = 1 + a + b;
//        int sum = 2 + a + b;
        int sum = 3 + a + b;
//        int sum = 4 + a + b;

        System.out.println("sum = " + sum);
    }
}
