package com.javarush.task.task14.task1405;

/**
 * Food
 * Давай напишем программу, которая поможет тебе выбрать, что съесть на обед.
 * Для этого нужно:
 * Реализовать интерфейс Selectable в классе Food.
 * Метод onSelect() должен выводить на экран фразу "The food was selected".
 * Подумай, какие методы можно вызвать для переменной food, а какие для — selectable.
 * В методе foodMethods вызови методы onSelect, onEat, если это возможно.
 * В методе selectableMethods вызови методы onSelect, onEat, если это возможно.
 * Не используй явное приведение типов.
 *
 * Требования:
 * 1. Интерфейс Selectable должен быть реализован в классе Food.
 * 2. Метод onSelect() в классе Food должен выводить на экран фразу "The food was selected".
 * 3. В методе foodMethods должны вызываться методы объекта типа Food.
 * 4. В методе selectableMethods должны вызываться методы доступные у любого объекта реализующего интерфейс Selectable.
*/

public class Solution {
    public static void main(String[] args) {
        Food food = new Food();
        Selectable selectable = new Food();
        Food newFood = (Food) selectable;

        foodMethods(food);
        selectableMethods(selectable);
    }

    public static void foodMethods(Food food) {
        food.onSelect();
        food.onEat();
    }

    public static void selectableMethods(Selectable selectable) {
        selectable.onSelect();
    }

    interface Selectable {
        void onSelect();
    }

    static class Food implements Selectable {
        public void onEat() {
            System.out.println("The food was eaten");
        }

        @Override
        public void onSelect() {
            System.out.println("The food was selected");
        }
    }
}
