package com.javarush.task.jdk13.task01.task0111;

/**
 * Объявление нескольких переменных
 * Объяви переменные a, b типа int и переменную s типа String.
 * Сразу же в строке объявления присвой им любые значения.
 *
 *
 * Требования:
 * 1. Объяви две переменные типа int.
 * 2. Объяви одну переменную типа String.
 * 3. Имена переменных типа int должны быть a и b.
 * 4. Имя переменной типа String должно быть s.
 * 5. Переменным сразу должны быть присвоены значения.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int a = 0, b = 1;
        String s = "s";
    }
}
